//Реализовать рекурсивную функцию которая находит факториал переданного в нее числа
//getFactorial(3) // в данном случае должна вернуть факториал числа 3! = 3 * 2 * 1

function getFactorial(n) {
    if (n === 1 || n === 0) {
        return 1;
    }
    return n * getFactorial(n - 1);
}
console.log(getFactorial(3));
//Реализовать рекурсивную функцию которая находит возводит число в степень.
//Число которое нужно возвести в степень передается как первый аргумент в функцию
//Степень передается как второй аргумент в функцию
// //pow(num, degree)
function pow(num, deg) {
    if (deg === 1) {
        return num
    }

    return num * pow(num, deg - 1);
}
console.log(pow(3, 2));
//Рекурсивное суммирование
//Задача: напишите рекурсивную функцию для вычисления суммы заданных положительных целых чисел a и b без прямого использования оператора +.
//Необходимоинкрементировать одно число на единицу до тех пор, пока другое число не окажется равным нулю.
function sum(num1, num2) {
    if (num2 === 0) {
        return num1;
    }
    return sum(num1 + 1, num2 - 1);
}
console.log(sum(3, 0));//3
console.log(sum(0, 5));//5
console.log(sum(5, 5));//10   
console.log(sum(2, 222));//224
